html/kotlin/functional/inline_function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>内联函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./lambda.html"> UP </a>
 |
 <a accesskey="H" href="./functional.html"> HOME </a>
</div><div id="content">
<h1 class="title">内联函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c02243">内联函数</a>
<ul>
<li><a href="#org61efe98">禁用内联</a></li>
<li><a href="#org65fb189">非局部返回</a></li>
<li><a href="#org2b5fbe0">具体化的类型参数</a></li>
</ul>
</li>
<li><a href="#org45cda33">内联属性</a></li>
<li><a href="#org9fc331f">公有 API 内联函数的限制</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1c02243" class="outline-2">
<h2 id="org1c02243">内联函数</h2>
<div class="outline-text-2" id="text-org1c02243">
<pre class="example">
    使用高阶函数会带来一些运行时的效率损失：每一个函数都是一个对象，并且会捕获一个闭包。 即那些在函数体内会访问到的变量

    内存分配（对于函数对象和类）和虚拟调用会引入运行时间开销
</pre>

<p>
但是在许多情况下通过 <b>内联化</b> <span class="underline">lambda</span> 表达式可以消除这类的开销 
</p>


<p>
考虑下面的情况：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">lock(l) { foo() }
</pre>
</div>

<p>
编译器没有为参数创建一个函数对象并生成一个调用。取而代之，编译器可以生成以下代码：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">l.lock()
<span style="color: #00bfff; font-weight: bold;">try</span> {
    foo()
}
<span style="color: #00bfff; font-weight: bold;">finally</span> {
    l.unlock()
}
</pre>
</div>

<pre class="example">
    这种情况是很好的例子，即 lock() 函数可以很容易地在调用处内联
</pre>

<p>
为了让编译器这么做，需要使用 <span class="underline">inline</span> 修饰符标记 lock() 函数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #98f5ff;">T&gt;</span> lock(lock: <span style="color: #98f5ff;">Lock</span>, body: () -&gt; <span style="color: #98f5ff;">T</span>): <span style="color: #98f5ff;">T</span> { &#8230;&#8230; }
</pre>
</div>

<p>
inline 修饰符影响函数本身和传给它的 lambda 表达式：所有这些都将内联到调用处 
</p>

<pre class="example">
    内联可能导致生成的代码增加

    不过如果使用得当（即避免内联过大函数），性能上会有所提升，尤其是在循环中的“超多态（megamorphic）”调用处
</pre>
</div>
<div id="outline-container-org61efe98" class="outline-3">
<h3 id="org61efe98">禁用内联</h3>
<div class="outline-text-3" id="text-org61efe98">
<p>
如果希望只内联一部分传给内联函数的 lambda 表达式参数，那么可以用 <span class="underline">noinline</span> 修饰符标记不希望内联的函数参数：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>(inlined: () -&gt; <span style="color: #98f5ff;">Unit</span>, <span style="color: #00bfff; font-weight: bold;">noinline</span> notInlined: () -&gt; <span style="color: #98f5ff;">Unit</span>) { &#8230;&#8230; }
</pre>
</div>


<p>
可以内联的 lambda 表达式只能在内联函数内部调用或者作为可内联的参数传递， 但是 noinline 的可以以任何喜欢的方式操作：存储在字段中、传送它等等
</p>

<pre class="example">
     需要注意的是，如果一个内联函数没有可内联的函数参数并且没有具体化的类型参数，编译器会产生一个警告

     因为内联这样的函数很可能并无益处。如果确认需要内联，则可以用 @Suppress("NOTHING_TO_INLINE") 注解关掉该警告
</pre>
</div>
</div>
<div id="outline-container-org65fb189" class="outline-3">
<h3 id="org65fb189">非局部返回</h3>
<div class="outline-text-3" id="text-org65fb189">
<p>
在 Kotlin 中，只能对 <span class="underline">具名</span> 或 <span class="underline">匿名函数</span> 使用正常的、 <b>非限定</b> 的 <span class="underline">return</span> 来退出
</p>

<pre class="example">
     这意味着要退出一个 lambda 表达式，必须使用一个 标签

     并且在 lambda 表达式内部禁止使用裸 return，因为 lambda 表达式不能使包含它的函数返回
</pre>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">ordinaryFunction</span>(block: () -&gt; <span style="color: #98f5ff;">Unit</span>) {
    println(<span style="color: #deb887;">"hi!"</span>)
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    ordinaryFunction {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#38169;&#35823;&#65306;&#19981;&#33021;&#20351; `foo` &#22312;&#27492;&#22788;&#36820;&#22238;</span>
    }
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<p>
但是如果 lambda 表达式传给的函数是 <span class="underline">内联的</span> ，该 return 也可以 <span class="underline">内联</span> ，所以它是允许的：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    inlined {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">OK&#65306;&#35813; lambda &#34920;&#36798;&#24335;&#26159;&#20869;&#32852;&#30340;</span>
    }
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<p>
这种返回（位于 lambda 表达式中，但退出包含它的函数）称为 <span class="underline">非局部返回</span> 。 习惯了在循环中用这种结构，其内联函数通常包含：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">hasZeros</span>(ints: <span style="color: #98f5ff;">List&lt;Int&gt;</span>): <span style="color: #98f5ff;">Boolean</span> {
    ints.forEach {
        <span style="color: #00bfff; font-weight: bold;">if</span> (<span style="color: #00bfff; font-weight: bold;">it</span> == 0) <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">true</span> <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20174; hasZeros &#36820;&#22238;</span>
    }
    <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">false</span>
}
</pre>
</div>

<p>
注意，一些内联函数可能调用传给它们的不是直接来自函数体、而是来自另一个执行上下文的 lambda 表达式参数
</p>

<pre class="example">
     例如来自局部对象或嵌套函数。在这种情况下，该 lambda 表达式中也不允许非局部控制流
</pre>

<p>
为了标识这种情况，该 lambda 表达式参数需要用 <span class="underline">crossinline</span> 修饰符标记:
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">f</span>(<span style="color: #00bfff; font-weight: bold;">crossinline</span> body: () -&gt; <span style="color: #98f5ff;">Unit</span>) {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">f</span> = <span style="color: #00bfff; font-weight: bold;">object</span>: <span style="color: #98f5ff;">Runnable</span> {
        <span style="color: #00bfff; font-weight: bold;">override</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">run</span>() = body()
    }
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;</span>
}
</pre>
</div>

<pre class="example">
break 和 continue 在内联的 lambda 表达式中还不可用，但计划支持它们
</pre>
</div>
</div>
<div id="outline-container-org2b5fbe0" class="outline-3">
<h3 id="org2b5fbe0">具体化的类型参数</h3>
<div class="outline-text-3" id="text-org2b5fbe0">
<p>
有时候需要访问一个作为参数传给的一个类型：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #98f5ff;">T&gt;</span> <span style="color: #98f5ff;">TreeNode.findParentOfType</span>(clazz: <span style="color: #98f5ff;">Class&lt;T&gt;</span>): <span style="color: #98f5ff;">T?</span> {
    <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">p</span> = parent
    <span style="color: #00bfff; font-weight: bold;">while</span> (p != <span style="color: #ffd700;">null</span> &amp;&amp; !clazz.isInstance(p)) {
        p = p.parent
    }
    @<span style="color: #98f5ff;">Suppress</span>(<span style="color: #deb887;">"UNCHECKED_CAST"</span>)
    <span style="color: #00bfff; font-weight: bold;">return</span> p <span style="color: #00bfff; font-weight: bold;">as</span> <span style="color: #98f5ff;">T?</span>
}
</pre>
</div>
<pre class="example">
     在这里向上遍历一棵树并且检测每个节点是不是特定的类型
</pre>

<p>
这都没有问题，但是调用处不是很优雅：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">treeNode.findParentOfType(<span style="color: #98f5ff;">MyTreeNode</span>::<span style="color: #00bfff; font-weight: bold;">class</span>.java)
</pre>
</div>

<p>
真正想要的只是传一个类型给该函数，即像这样调用它：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">treeNode.findParentOfType&lt;<span style="color: #98f5ff;">MyTreeNode&gt;</span>()
</pre>
</div>

<p>
为能够这么做，内联函数支持 <span class="underline">具体化的类型参数</span> ，于是可以这样写：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #00bfff; font-weight: bold;">reified</span> <span style="color: #98f5ff;">T&gt;</span> <span style="color: #98f5ff;">TreeNode.findParentOfType</span>(): <span style="color: #98f5ff;">T?</span> {
    <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">p</span> = parent
    <span style="color: #00bfff; font-weight: bold;">while</span> (p != <span style="color: #ffd700;">null</span> &amp;&amp; p !<span style="color: #00bfff; font-weight: bold;">is</span> <span style="color: #98f5ff;">T</span>) {
        p = p.parent
    }
    <span style="color: #00bfff; font-weight: bold;">return</span> p <span style="color: #00bfff; font-weight: bold;">as</span> <span style="color: #98f5ff;">T?</span>
}
</pre>
</div>

<p>
使用 <span class="underline">reified</span> 修饰符来限定类型参数，现在可以在函数内部访问它了，几乎就像是一个普通的类一样
</p>

<pre class="example">
     由于函数是内联的，不需要反射，正常的操作符如 !is 和 as 现在都能用了

     此外，还可以按照上面提到的方式调用它：myTree.findParentOfType&lt;MyTreeNodeType&gt;()
</pre>

<p>
虽然在许多情况下可能不需要反射，但仍然可以对一个具体化的类型参数使用它：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #00bfff; font-weight: bold;">reified</span> <span style="color: #98f5ff;">T&gt;</span> membersOf() = <span style="color: #98f5ff;">T</span>::<span style="color: #00bfff; font-weight: bold;">class</span>.members

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>(s: <span style="color: #98f5ff;">Array&lt;String&gt;</span>) {
    println(membersOf&lt;<span style="color: #98f5ff;">StringBuilder&gt;</span>().joinToString(<span style="color: #deb887;">"\n"</span>))
}
</pre>
</div>

<pre class="example">
     普通的函数（未标记为内联函数的）不能有具体化参数。

     不具有运行时表示的类型（例如非具体化的类型参数或者类似于Nothing的虚构类型） 不能用作具体化的类型参数的实参
</pre>
</div>
</div>
</div>
<div id="outline-container-org45cda33" class="outline-2">
<h2 id="org45cda33">内联属性</h2>
<div class="outline-text-2" id="text-org45cda33">
<p>
inline 修饰符可用于 <b>没有</b> <span class="underline">幕后字段</span> 的 <span class="underline">属性</span> 的 <b>访问器</b> 。 可以标注独立的属性访问器：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">foo</span>: <span style="color: #98f5ff;">Foo</span>
    <span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">get</span>() = <span style="color: #98f5ff;">Foo</span>()

<span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">bar</span>: <span style="color: #98f5ff;">Bar</span>
    <span style="color: #00bfff; font-weight: bold;">get</span>() = &#8230;&#8230;
    <span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">set</span>(v) { &#8230;&#8230; }
</pre>
</div>


<p>
也可以标注整个属性，将它的两个访问器都标记为内联： 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">bar</span>: <span style="color: #98f5ff;">Bar</span>
    <span style="color: #00bfff; font-weight: bold;">get</span>() = &#8230;&#8230;
    <span style="color: #00bfff; font-weight: bold;">set</span>(v) { &#8230;&#8230; }
</pre>
</div>

<p>
在调用处，内联访问器如同内联函数一样内联
</p>
</div>
</div>
<div id="outline-container-org9fc331f" class="outline-2">
<h2 id="org9fc331f">公有 API 内联函数的限制</h2>
<div class="outline-text-2" id="text-org9fc331f">
<p>
当一个内联函数是 public 或 protected 而不是 private 或 internal 声明的一部分时，就会认为它是一个模块级的公有 API。可以在其他模块中调用它，并且也可以在调用处内联这样的调用
</p>

<pre class="example">
    这带来了一些由模块做这样变更时导致的二进制兼容的风险：声明一个内联函数但调用它的模块在它修改后并没有重新编译
</pre>
<p>
为了消除这种由非公有 API 变更引入的不兼容的风险， <span class="underline">公有 API</span> <b>内联函数体</b> 内 <b>不允许</b> 使用 <span class="underline">非公有声明</span> ，即，不允许使用 <span class="underline">private</span> 与 <span class="underline">internal</span> 声明以及其部件 
</p>

<pre class="example">
    一个 internal 声明可以由 @PublishedApi 标注，这会允许它在公有 API 内联函数中使用

    当一个 internal 内联函数标记有 @PublishedApi 时，也会像公有函数一样检测其函数体
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="lambda.html">Previous：Lambda表达式</a></td>
<td class="org-left"><a href="functional.html">Home：函数式</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
